Documents/ПоступлениеВКассу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПоступлениеВКассу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПерсоналом</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоДоговорамАренды</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПКО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоОт</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСКонтрагентом</Name>
					<Comment>(фин)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт1</Name>
					<Comment>(фин)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт2</Name>
					<Comment>(фин)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт3</Name>
					<Comment>(фин)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Comment>(Регл) Банковский счет организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛистУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депозит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКасса</Name>
					<Comment>(бух)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСКонтрагентомБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовПоАвансамБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормированияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредствБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредствБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СуммыИнкассацииПоЛистамУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛистУчета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛистУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыСПерсоналом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПерсоналом</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРасходованиеСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПКО</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствРозничнаяВыручка</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхДенежныхСредствВБанке</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПостояннойЧастиАрендыОтАрендатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПеременнойЧастиАрендыОтАрендатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДепозитаОтАрендатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПостояннойЧастиАрендыОтАрендодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПеременнойЧастиАрендыОтАрендодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДепозитаОтАрендодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеНаличныхСРасчетногоСчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеВКассу/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;


Функция ПодготовитьШапкуДокумента(Заголовок, СтруктураШапкиДокумента, Отказ)
	
	СтруктураШапкиДокумента   = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	Возврат СтруктураШапкиДокумента;
	
КонецФункции

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ПКО","Приходный кассовый ордер");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#Если Клиент Тогда

// Определяет коды счетов дебета и кредита для вывода в печатную форму.
//
Функция ОпределитьКодыСчетСубсчет() 
	
	КодыСчетов=Новый Структура("Дебет,Кредит");
	
	// Определяем код счета дебета
	
	СчетДт=ПланыСчетов.Финансовый.Касса.Код;
		
	КодыСчетов.Дебет=СчетДт;
	
	Если ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
		СтрокаКредит										= ПланыСчетов.Финансовый.ВыручкаТорговыхТочек.Код;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке Тогда
		СтрокаКредит										= ПланыСчетов.Финансовый.РасчетныйСчет.Код;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее Тогда
		СтрокаКредит										= СчетУчетаРасчетовСКонтрагентом.Код;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.Инкассация Тогда
		СтрокаКредит										= ПланыСчетов.Финансовый.ДенежныеСредстваВПутиИнкассация.Код;
	ИначеЕсли (ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПостояннойЧастиАрендыОтАрендатора)
		ИЛИ (ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПеременнойЧастиАрендыОтАрендатора)
		ИЛИ (ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаДепозитаОтАрендатора) Тогда
		СтрокаКредит										= ПланыСчетов.Финансовый.РасчетыСПокупателямиПоАренде.Код;
	КонецЕсли;
		
	
	КодыСчетов.Кредит=СтрокаКредит;
	
	Возврат КодыСчетов;
	
КонецФункции // ОпределитьКодыСчетСубсчет()

Функция РубКоп(Сумма)
	
	Руб=Цел(Сумма);
	Коп=ОКР(100*(Сумма-Руб),0,1);
	СуммаРубКоп=""+Руб+" руб. "+Цел(Коп/10)+(Коп-10*Цел(Коп/10))+" коп.";
	Возврат СуммаРубКоп;
	
КонецФункции

// Функция формирует табличный документ с печатной формой ПКО
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПКО()
	
	Перем ПодразделениеОтветственныхЛиц;

	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Номер,
	|	ПриходныйКассовыйОрдер.Дата КАК ДатаДокумента,
	|	ПриходныйКассовыйОрдер.Организация,
	|	ПриходныйКассовыйОрдер.Контрагент,
	|	ПриходныйКассовыйОрдер.Контрагент.Представление КАК Контрагент,
	|	ПриходныйКассовыйОрдер.ПринятоОт КАК ПринятоОт,
	|	ПриходныйКассовыйОрдер.Основание КАК Основание,
	|	ПриходныйКассовыйОрдер.Приложение КАК Приложение,
	|	ПриходныйКассовыйОрдер.СуммаДокумента КАК Сумма,
	|	ПриходныйКассовыйОрдер.СтруктурнаяЕдиница КАК ПодразделениеОрганизации,
	|	ПриходныйКассовыйОрдер.Комментарий,
	|	ПриходныйКассовыйОрдер.Ответственный
	|ИЗ
	|	Документ.ПоступлениеВКассу КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Макет       = ПолучитьОбщийМакет("КО1");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриходныйКассовыйОрдер_КО1";
	
	ЕстьРасчетыСКонтрагентами = УправлениеДенежнымиСредствами.ЕстьРасчетыСКонтрагентами(ВидОперации);
	ЕстьРасчетыПоКредитам     = УправлениеДенежнымиСредствами.ЕстьРасчетыПоКредитам(ВидОперации);
	
	Валютный = Ложь;

	// Выводим шапку ПКО

	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");

	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеСокращенное,");
	
	ОбластьМакета.Параметры.СуммаРубКоп       = РубКоп(Шапка.Сумма);
	ОбластьМакета.Параметры.Сумма		      = Формат(Шапка.Сумма,"ЧЦ=15; ЧДЦ=2");
	ОбластьМакета.Параметры.СуммаПрописью     = ОбщегоНазначения.СформироватьСуммуПрописью(Шапка.Сумма, мВалютаРегламентированногоУчета);
	
	ОбластьМакета.Параметры.ОрганизацияПоОКПО = СведенияОбОрганизации.КодПоОКПО;
	ОбластьМакета.Параметры.ДатаДокумента     = Шапка.ДатаДокумента;
	ОбластьМакета.Параметры.НомерДокумента    = ОбщегоНазначения.ПолучитьНомерНаПечать(Шапка);

	КодыСчетСубсчет = ОпределитьКодыСчетСубсчет();

	ОбластьМакета.Параметры.КодДебета = КодыСчетСубсчет.Дебет;
	ОбластьМакета.Параметры.СубСчет   = КодыСчетСубсчет.Кредит;


	ОбластьМакета.Параметры.ПредставлениеПодразделения = Шапка.ПодразделениеОрганизации;
	
	ОбластьМакета.Параметры.ФИОКассира	= Шапка.Ответственный;
	ОбластьМакета.Параметры.ПринятоОт  	= Шапка.ПринятоОт;
	ОбластьМакета.Параметры.Основание  	= ?(ЗначениеЗаполнено(Шапка.Основание), Шапка.Основание, Шапка.Комментарий);;
	ОбластьМакета.Параметры.Приложение 	= Шапка.Приложение;

	ОтветственныеЛица = ОбщегоНазначения.ОтветственныеЛица(Шапка.Организация, Шапка.ДатаДокумента);
 
	ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = ОтветственныеЛица.ГлавныйБухгалтерПредставление;
	
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции

//// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходимое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "ПКО" Тогда
		
		ТабДокумент = ПечатьПКО();
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, Строка(ВидОперации)), НепосредственнаяПечать);
	
КонецПроцедуры

//// Пересчитывает сумму НДС
////
//Процедура ПересчитатьСуммуНДС(СтрокаПлатеж) Экспорт

//	ЗначениеСтавкиНДС     = УчетНДС.ПолучитьСтавкуНДС(СтрокаПлатеж.СтавкаНДС);

//	СтрокаПлатеж.СуммаНДС = СтрокаПлатеж.СуммаПлатежа * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС);

//КонецПроцедуры // ПересчитатьСуммуНДС()

#КонецЕсли

//Процедура РассчитатьСуммуДокумента() Экспорт
//	Если (ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаАрендыОтАрендатора)
//		ИЛИ (ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратЗаАрендуОтАрендодателя) Тогда
//		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
//	КонецЕсли;
//КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//АК БЕЛН 06.04.2017+
	Если ЭтоНовый() Тогда
		УстановитьНовыйНомер(Организация.Префикс);
	КонецЕсли; 
	//АК БЕЛН 06.04.2017-
	Если (НЕ ЭтотОбъект.ДоговорКонтрагента = ЭтотОбъект.Ссылка.ДоговорКонтрагента)
			И ДопМодульСервер.НекорректныйДоговор(ЭтотОбъект.ДоговорКонтрагента) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Указан некорректный договор (помечен на удаление либо не используется)");
		Отказ = Истина;
	КонецЕсли;
	
	//Если ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаАрендыОтАрендатора
	//	ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратЗаАрендуОтАрендодателя Тогда
	//	Если СуммаДокумента <> РасшифровкаПлатежа.Итог("СуммаПлатежа") Тогда
	//		ОбщегоНазначения.СообщитьОбОшибке("Сумма документа не совпадает с расшифровкой");
	//		Отказ = Истина;
	//	КонецЕсли;
	//Иначе
	//	РасшифровкаПлатежа.Очистить();
	//КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ПериодРегистрации 	= Дата("00010101");
	ЭтотОбъект.Депозит 				= Ложь;
	
	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЭтотОбъект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнойОтветственный");
	
	//
	ЭтотОбъект.СуммыИнкассацииПоЛистамУчета.Очистить();
	
	ОбщегоНазначенияКлиентСервер.ПроверкаРеквизитовПомеченныхНаУдаление(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Заголовок для сообщений об ошибках проведения.
	
	Если ЭтотОбъект.СтатьяДвиженияДенежныхСредствБУ.Пустая()
			И ЭтотОбъект.Дата >= Дата(2015, 5, 8)
			И НЕ ЭтотОбъект.Организация = Справочники.Организации.Избенка Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнена статья ДДС бух.учета");
		Отказ = Истина;
	КонецЕсли;
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ЭтотОбъект.Ссылка);
	
	Движения.Финансовый.Записывать = Истина;
	Движения.Финансовый.Очистить();
	
	Движения.РасчетыСПерсоналом.Записывать = Истина;
	Движения.РасчетыСПерсоналом.Очистить();
	
	//
	Проводка = Движения.Финансовый.Добавить();
	Проводка.Период	= ЭтотОбъект.Дата;
	Проводка.СчетДт = ПланыСчетов.Финансовый.Касса;
	Проводка.Сумма	= ЭтотОбъект.СуммаДокумента;
	//Проводка.Организация			= Организация;
	//Проводка.СтруктурнаяЕдиница		= СтруктурнаяЕдиница;
	
	Проводка.СубконтоДт.СтруктурныеЕдиницы 				= ЭтотОбъект.СтруктурнаяЕдиница;
	Проводка.СубконтоДт.СтатьиДвиженияДенежныхСредств 	= ЭтотОбъект.СтатьяДвиженияДенежныхСредств;
	Если Проводка.Период >= '20150101' Тогда
		Проводка.СубконтоДт.Организации 				= ЭтотОбъект.Организация;
	Иначе
		Проводка.СубконтоДт.Организации 				= Справочники.Организации.ПустаяСсылка();	
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
		
		Проводка.СчетКт	= ПланыСчетов.Финансовый.ВыручкаТорговыхТочек;
		Проводка.СубконтоКт.ТорговыеТочки			= ЭтотОбъект.СтруктурнаяЕдиница;
		Проводка.СубконтоКт.СтатьиДоходовРасходов	= Справочники.СтатьиДоходовРасходов.РозничнаяВыручка;
		Проводка.Содержание							= "Выручка ТТ";
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке Тогда
		
		Проводка.СчетКт	= ПланыСчетов.Финансовый.РасчетныйСчет;
		Проводка.СубконтоКт.Организации						= ЭтотОбъект.Организация;
		Проводка.СубконтоКт.БанковскиеСчета					= ЭтотОбъект.СчетОрганизации;
		Проводка.СубконтоКт.СтатьиДвиженияДенежныхСредств   = ЭтотОбъект.СтатьяДвиженияДенежныхСредств;
		Проводка.Содержание									= "Получение наличных денежных средств в банке";
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее Тогда
		
		Проводка.СчетКт	= ЭтотОбъект.СчетУчетаРасчетовСКонтрагентом;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СубконтоКт1);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СубконтоКт2);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СубконтоКт3);
		Проводка.Содержание									= "Прочее поступление денежных средств";
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.Инкассация Тогда
		
		Проводка.СчетКт	= ПланыСчетов.Финансовый.ДенежныеСредстваВПутиИнкассация;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ЭтотОбъект.Организация);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ЭтотОбъект.ТорговаяТочка);
		Проводка.Содержание									= "Прием инкассации";
		
	ИначеЕсли (ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПостояннойЧастиАрендыОтАрендатора)
			ИЛИ (ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПеременнойЧастиАрендыОтАрендатора)
			ИЛИ (ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаДепозитаОтАрендатора)
			ИЛИ (ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратПостояннойЧастиАрендыОтАрендодателя)
			ИЛИ (ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратПеременнойЧастиАрендыОтАрендодателя)
			ИЛИ (ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДепозитаОтАрендодателя) Тогда
		
		Проводка.СчетКт	= ПланыСчетов.Финансовый.РасчетыСПокупателямиПоАренде;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Справочники.Организации.Избенка);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ЭтотОбъект.ТорговаяТочка);
		Проводка.Содержание									= ЭтотОбъект.ВидОперации;
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратЗаработнойПлаты Тогда
		
		Проводка.СчетКт	= ЭтотОбъект.СчетУчетаРасчетовСКонтрагентом;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ЭтотОбъект.Организация);
		Проводка.Содержание									= "Возврат заработной платы";
		
		Движение = Движения.РасчетыСПерсоналом.Добавить();
		Движение.ВидДвижения						= ВидДвиженияНакопления.Расход;
		Движение.Регистратор						= ЭтотОбъект.Ссылка;
		Движение.Период								= ЭтотОбъект.Дата;
		Движение.Организация						= ЭтотОбъект.Организация;
		Движение.Физлицо							= ЭтотОбъект.Контрагент;
		Движение.Сумма								= - ЭтотОбъект.СуммаДокумента;
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.СнятиеНаличныхСРасчетногоСчета Тогда
		
		Проводка.СчетКт									= ПланыСчетов.Финансовый.СнятиеНаличныхСРасчетногоСчета;
		Проводка.СубконтоКт.Организации					= ЭтотОбъект.Организация;
		Проводка.СубконтоКт.ИсточникиДенежныхСредств	= СубконтоКт2;
		Проводка.СубконтоКт.СтруктурныеЕдиницы		    = ЭтотОбъект.СтруктурнаяЕдиница;
		Проводка.Содержание								= "Возврат наличных денежных средств в банке";
		
	КонецЕсли;
	
	//
	ОбщиеПроцедуры.ПровестиДокументПоРегиструВзаиморасчетыПоАренде(ЭтотОбъект, Отказ);
	
	//
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентами.ДобавитьПриход();
	Движение.Период			 	= ЭтотОбъект.Дата;
	Движение.Организация 		= ЭтотОбъект.Организация;
	Движение.Контрагент 		= ЭтотОбъект.Контрагент;
	Движение.ДоговорКонтрагента = ЭтотОбъект.ДоговорКонтрагента;
	Движение.Сумма 				= ЭтотОбъект.СуммаДокумента;
	
	//
	АК_УчетМСФО.ЗаполнитьОрганизацию(Движения.Финансовый, ЭтотОбъект.Организация);
	//+++АК БЕЛН 20170413
	Если Не Отказ И НЕ ВидОперации=Перечисления.ВидыОперацийПКО.Инкассация Тогда
		Узел = ПланыОбмена.ОбменИзбенкаСБП.НайтиПоКоду("БП");
		//ПланыОбмена.ЗарегистрироватьИзменения(Узел,Ссылка);
		ОбменДанными.Получатели.Добавить(Узел);
	КонецЕсли; 
	
	//---АК БЕЛН 20170413
КонецПроцедуры


мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
